Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF4580.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B2SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B2SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE41">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B2SID3" edc:desc="" edc:mask="0x1" edc:name="B2SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2SID4" edc:desc="" edc:mask="0x1" edc:name="B2SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2SID5" edc:desc="" edc:mask="0x1" edc:name="B2SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2SID6" edc:desc="" edc:mask="0x1" edc:name="B2SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2SID7" edc:desc="" edc:mask="0x1" edc:name="B2SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2SID8" edc:desc="" edc:mask="0x1" edc:name="B2SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2SID9" edc:desc="" edc:mask="0x1" edc:name="B2SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2SID10" edc:desc="" edc:mask="0x1" edc:name="B2SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="B2SIDL" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu-uu" edc:name="B2SIDL" edc:nzwidth="0x8" edc:por="xxxxx-xx" edc:_addr="0xE42">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRR" edc:desc="" edc:mask="0x1" edc:name="SRR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B2EID16" edc:desc="" edc:mask="0x1" edc:name="B2EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2EID17" edc:desc="" edc:mask="0x1" edc:name="B2EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="B2EXID" edc:desc="" edc:mask="0x1" edc:name="B2EXID" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2SRR" edc:desc="" edc:mask="0x1" edc:name="B2SRR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2SID0" edc:desc="" edc:mask="0x1" edc:name="B2SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2SID1" edc:desc="" edc:mask="0x1" edc:name="B2SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2SID2" edc:desc="" edc:mask="0x1" edc:name="B2SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="B2EXIDE" edc:desc="" edc:mask="0x1" edc:name="B2EXIDE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B2EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B2EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE43">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B2EID8" edc:desc="" edc:mask="0x1" edc:name="B2EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2EID9" edc:desc="" edc:mask="0x1" edc:name="B2EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2EID10" edc:desc="" edc:mask="0x1" edc:name="B2EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2EID11" edc:desc="" edc:mask="0x1" edc:name="B2EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2EID12" edc:desc="" edc:mask="0x1" edc:name="B2EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2EID13" edc:desc="" edc:mask="0x1" edc:name="B2EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2EID14" edc:desc="" edc:mask="0x1" edc:name="B2EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2EID15" edc:desc="" edc:mask="0x1" edc:name="B2EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
