Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF4580.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B2EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B2EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE44">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B2EID0" edc:desc="" edc:mask="0x1" edc:name="B2EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2EID1" edc:desc="" edc:mask="0x1" edc:name="B2EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2EID2" edc:desc="" edc:mask="0x1" edc:name="B2EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2EID3" edc:desc="" edc:mask="0x1" edc:name="B2EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2EID4" edc:desc="" edc:mask="0x1" edc:name="B2EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2EID5" edc:desc="" edc:mask="0x1" edc:name="B2EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2EID6" edc:desc="" edc:mask="0x1" edc:name="B2EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2EID7" edc:desc="" edc:mask="0x1" edc:name="B2EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nrrnnnn" edc:cname="B2DLC" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="B2DLC" edc:nzwidth="0x8" edc:por="-xxxxxxx" edc:_addr="0xE45">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DLC0" edc:desc="" edc:mask="0x1" edc:name="DLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC1" edc:desc="" edc:mask="0x1" edc:name="DLC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC2" edc:desc="" edc:mask="0x1" edc:name="DLC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC3" edc:desc="" edc:mask="0x1" edc:name="DLC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTR_TXRTR" edc:desc="" edc:mask="0x1" edc:name="RXRTR/TXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="RESRB0" edc:desc="" edc:mask="0x1" edc:name="RESRB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RESRB1" edc:desc="" edc:mask="0x1" edc:name="RESRB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXRTR" edc:desc="" edc:mask="0x1" edc:name="TXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="RXRTR" edc:desc="" edc:mask="0x1" edc:name="RXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B2DLC0" edc:desc="" edc:mask="0x1" edc:name="B2DLC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2DLC1" edc:desc="" edc:mask="0x1" edc:name="B2DLC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2DLC2" edc:desc="" edc:mask="0x1" edc:name="B2DLC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2DLC3" edc:desc="" edc:mask="0x1" edc:name="B2DLC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2RB0" edc:desc="" edc:mask="0x1" edc:name="B2RB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2RB1" edc:desc="" edc:mask="0x1" edc:name="B2RB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2RXRTR" edc:desc="" edc:mask="0x1" edc:name="B2RXRTR" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B2D0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B2D0" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE46">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B2D00" edc:desc="" edc:mask="0x1" edc:name="B2D00" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D01" edc:desc="" edc:mask="0x1" edc:name="B2D01" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D02" edc:desc="" edc:mask="0x1" edc:name="B2D02" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D03" edc:desc="" edc:mask="0x1" edc:name="B2D03" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D04" edc:desc="" edc:mask="0x1" edc:name="B2D04" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D05" edc:desc="" edc:mask="0x1" edc:name="B2D05" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D06" edc:desc="" edc:mask="0x1" edc:name="B2D06" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D07" edc:desc="" edc:mask="0x1" edc:name="B2D07" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
