Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF4580.PIC
        <edc:SFRDef edc:access="crrrn-nn" edc:cname="TXB0CON" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TXB0CON" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xF40">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXPRI0" edc:desc="" edc:mask="0x1" edc:name="TXPRI0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXPRI1" edc:desc="" edc:mask="0x1" edc:name="TXPRI1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TXREQ" edc:desc="" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXERR" edc:desc="" edc:mask="0x1" edc:name="TXERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXLARB" edc:desc="" edc:mask="0x1" edc:name="TXLARB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXABT" edc:desc="" edc:mask="0x1" edc:name="TXABT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXBIF" edc:desc="" edc:mask="0x1" edc:name="TXBIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="TXB0PRI0" edc:desc="" edc:mask="0x1" edc:name="TXB0PRI0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0PRI1" edc:desc="" edc:mask="0x1" edc:name="TXB0PRI1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0REQ" edc:desc="" edc:mask="0x1" edc:name="TXB0REQ" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0ERR" edc:desc="" edc:mask="0x1" edc:name="TXB0ERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0LARB" edc:desc="" edc:mask="0x1" edc:name="TXB0LARB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0ABT" edc:desc="" edc:mask="0x1" edc:name="TXB0ABT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX0IF" edc:desc="" edc:mask="0x1" edc:name="TX0IF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF41">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="TXB0SID3" edc:desc="" edc:mask="0x1" edc:name="TXB0SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0SID4" edc:desc="" edc:mask="0x1" edc:name="TXB0SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0SID5" edc:desc="" edc:mask="0x1" edc:name="TXB0SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0SID6" edc:desc="" edc:mask="0x1" edc:name="TXB0SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0SID7" edc:desc="" edc:mask="0x1" edc:name="TXB0SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0SID8" edc:desc="" edc:mask="0x1" edc:name="TXB0SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0SID9" edc:desc="" edc:mask="0x1" edc:name="TXB0SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0SID10" edc:desc="" edc:mask="0x1" edc:name="TXB0SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-n-nn" edc:cname="TXB0SIDL" edc:desc="" edc:impl="0xeb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-u-uu" edc:name="TXB0SIDL" edc:nzwidth="0x8" edc:por="xxx-x-xx" edc:_addr="0xF42">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="TXB0EID16" edc:desc="" edc:mask="0x1" edc:name="TXB0EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID17" edc:desc="" edc:mask="0x1" edc:name="TXB0EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0EXIDE" edc:desc="" edc:mask="0x1" edc:name="TXB0EXIDE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0SID0" edc:desc="" edc:mask="0x1" edc:name="TXB0SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0SID1" edc:desc="" edc:mask="0x1" edc:name="TXB0SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0SID2" edc:desc="" edc:mask="0x1" edc:name="TXB0SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF43">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="TXB0EID8" edc:desc="" edc:mask="0x1" edc:name="TXB0EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID9" edc:desc="" edc:mask="0x1" edc:name="TXB0EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID10" edc:desc="" edc:mask="0x1" edc:name="TXB0EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID11" edc:desc="" edc:mask="0x1" edc:name="TXB0EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID12" edc:desc="" edc:mask="0x1" edc:name="TXB0EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID13" edc:desc="" edc:mask="0x1" edc:name="TXB0EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID14" edc:desc="" edc:mask="0x1" edc:name="TXB0EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID15" edc:desc="" edc:mask="0x1" edc:name="TXB0EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF44">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="TXB0EID0" edc:desc="" edc:mask="0x1" edc:name="TXB0EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID1" edc:desc="" edc:mask="0x1" edc:name="TXB0EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID2" edc:desc="" edc:mask="0x1" edc:name="TXB0EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID3" edc:desc="" edc:mask="0x1" edc:name="TXB0EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID4" edc:desc="" edc:mask="0x1" edc:name="TXB0EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID5" edc:desc="" edc:mask="0x1" edc:name="TXB0EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID6" edc:desc="" edc:mask="0x1" edc:name="TXB0EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID7" edc:desc="" edc:mask="0x1" edc:name="TXB0EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
