Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF4580.PIC
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB1D4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D4" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF5A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D40" edc:desc="" edc:mask="0x1" edc:name="RXB1D40" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D41" edc:desc="" edc:mask="0x1" edc:name="RXB1D41" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D42" edc:desc="" edc:mask="0x1" edc:name="RXB1D42" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D43" edc:desc="" edc:mask="0x1" edc:name="RXB1D43" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D44" edc:desc="" edc:mask="0x1" edc:name="RXB1D44" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D45" edc:desc="" edc:mask="0x1" edc:name="RXB1D45" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D46" edc:desc="" edc:mask="0x1" edc:name="RXB1D46" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D47" edc:desc="" edc:mask="0x1" edc:name="RXB1D47" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB1D5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D5" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF5B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D50" edc:desc="" edc:mask="0x1" edc:name="RXB1D50" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D51" edc:desc="" edc:mask="0x1" edc:name="RXB1D51" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D52" edc:desc="" edc:mask="0x1" edc:name="RXB1D52" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D53" edc:desc="" edc:mask="0x1" edc:name="RXB1D53" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D54" edc:desc="" edc:mask="0x1" edc:name="RXB1D54" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D55" edc:desc="" edc:mask="0x1" edc:name="RXB1D55" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D56" edc:desc="" edc:mask="0x1" edc:name="RXB1D56" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D57" edc:desc="" edc:mask="0x1" edc:name="RXB1D57" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB1D6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D6" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF5C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D60" edc:desc="" edc:mask="0x1" edc:name="RXB1D60" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D61" edc:desc="" edc:mask="0x1" edc:name="RXB1D61" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D62" edc:desc="" edc:mask="0x1" edc:name="RXB1D62" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D63" edc:desc="" edc:mask="0x1" edc:name="RXB1D63" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D64" edc:desc="" edc:mask="0x1" edc:name="RXB1D64" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D65" edc:desc="" edc:mask="0x1" edc:name="RXB1D65" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D66" edc:desc="" edc:mask="0x1" edc:name="RXB1D66" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D67" edc:desc="" edc:mask="0x1" edc:name="RXB1D67" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB1D7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D7" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF5D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D70" edc:desc="" edc:mask="0x1" edc:name="RXB1D70" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D71" edc:desc="" edc:mask="0x1" edc:name="RXB1D71" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D72" edc:desc="" edc:mask="0x1" edc:name="RXB1D72" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D73" edc:desc="" edc:mask="0x1" edc:name="RXB1D73" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D74" edc:desc="" edc:mask="0x1" edc:name="RXB1D74" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D75" edc:desc="" edc:mask="0x1" edc:name="RXB1D75" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D76" edc:desc="" edc:mask="0x1" edc:name="RXB1D76" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D77" edc:desc="" edc:mask="0x1" edc:name="RXB1D77" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="CANSTAT_RO0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="CANSTAT_RO0" edc:nzwidth="0x8" edc:por="10000000" edc:_addr="0xF5E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE1_ICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE1/ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE2_ICODE1" edc:desc="" edc:mask="0x1" edc:name="EICODE2/ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE3_ICODE2" edc:desc="" edc:mask="0x1" edc:name="EICODE3/ICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE4" edc:desc="" edc:mask="0x1" edc:name="EICODE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE0" edc:desc="" edc:mask="0x1" edc:name="OPMODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE1" edc:desc="" edc:mask="0x1" edc:name="OPMODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE2" edc:desc="" edc:mask="0x1" edc:name="OPMODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ICODE0" edc:desc="" edc:mask="0x1" edc:name="ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE1" edc:desc="" edc:mask="0x1" edc:name="ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE2" edc:desc="" edc:mask="0x1" edc:name="ICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE3" edc:desc="" edc:mask="0x1" edc:name="ICODE3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE4" edc:desc="" edc:mask="0x1" edc:name="ICODE4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnsnnnr" edc:cname="CANCON_RO0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="CANCON_RO0" edc:nzwidth="0x8" edc:por="10000000" edc:_addr="0xF5F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FP0" edc:desc="" edc:mask="0x1" edc:name="FP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN0_FP1" edc:desc="" edc:mask="0x1" edc:name="WIN0/FP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN1_FP2" edc:desc="" edc:mask="0x1" edc:name="WIN1/FP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN2_FP3" edc:desc="" edc:mask="0x1" edc:name="WIN2/FP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP0" edc:desc="" edc:mask="0x1" edc:name="REQOP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP1" edc:desc="" edc:mask="0x1" edc:name="REQOP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP2" edc:desc="" edc:mask="0x1" edc:name="REQOP2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WIN0" edc:desc="" edc:mask="0x1" edc:name="WIN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN1" edc:desc="" edc:mask="0x1" edc:name="WIN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN2" edc:desc="" edc:mask="0x1" edc:name="WIN2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0xf" edc:beginaddr="0xf60" edc:endaddr="0x1000" edc:regionid="accesssfr">
        <edc:SFRDef edc:access="cnnrrnrr" edc:cname="RXB0CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RXB0CON" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xF60">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FILHIT0" edc:desc="" edc:mask="0x1" edc:name="FILHIT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="JTOFF_FILHIT1" edc:desc="" edc:mask="0x1" edc:name="JTOFF/FILHIT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0DBEN_FILHIT2" edc:desc="" edc:mask="0x1" edc:name="RXB0DBEN/FILHIT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTRRO_FILHIT3" edc:desc="" edc:mask="0x1" edc:name="RXRTRRO/FILHIT3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT4" edc:desc="" edc:mask="0x1" edc:name="FILHIT4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXM0_RTRRO" edc:desc="" edc:mask="0x1" edc:name="RXM0/RTRRO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXM1" edc:desc="" edc:mask="0x1" edc:name="RXM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXFUL" edc:desc="" edc:mask="0x1" edc:name="RXFUL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="JTOFF" edc:desc="" edc:mask="0x1" edc:name="JTOFF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0DBEN" edc:desc="" edc:mask="0x1" edc:name="RXB0DBEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTRRO" edc:desc="" edc:mask="0x1" edc:name="RXRTRRO" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RXM0" edc:desc="" edc:mask="0x1" edc:name="RXM0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="FILHIT1" edc:desc="" edc:mask="0x1" edc:name="FILHIT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT2" edc:desc="" edc:mask="0x1" edc:name="FILHIT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT3" edc:desc="" edc:mask="0x1" edc:name="FILHIT3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RTRRO" edc:desc="" edc:mask="0x1" edc:name="RTRRO" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RXBODBEN" edc:desc="" edc:mask="0x1" edc:name="RXBODBEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXB0FILHIT0" edc:desc="" edc:mask="0x1" edc:name="RXB0FILHIT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0FILHIT1" edc:desc="" edc:mask="0x1" edc:name="RXB0FILHIT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0FILHIT2" edc:desc="" edc:mask="0x1" edc:name="RXB0FILHIT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0FILHIT3" edc:desc="" edc:mask="0x1" edc:name="RXB0FILHIT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0FILHIT4" edc:desc="" edc:mask="0x1" edc:name="RXB0FILHIT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0M0" edc:desc="" edc:mask="0x1" edc:name="RXB0M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0M1" edc:desc="" edc:mask="0x1" edc:name="RXB0M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0FUL" edc:desc="" edc:mask="0x1" edc:name="RXB0FUL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="RXB0RTRR0" edc:desc="" edc:mask="0x1" edc:name="RXB0RTRR0" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0RTRRO" edc:desc="" edc:mask="0x1" edc:name="RXB0RTRRO" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
